{"wdi-DC.DAC.SVKL.CD": {"data": {"2008": {"CUB": 90000.00358, "HTI": 50000.00075}, "2012": {"HTI": 19999.99955}, "2015": {"CUB": 19999.99955, "HTI": 239999.9946}, "2016": {"CUB": 59999.99866, "HTI": 379999.9952}, "2017": {"CUB": 29999.99933, "HTI": 330000.0131}, "2018": {"CUB": 19999.99955, "HTI": 150000.006, "MDV": 0.0}, "2019": {"CUB": 9999.999776, "HTI": 129999.9952, "MDV": 0.0}, "recentValue": {"CUB": 9999.999776, "HTI": 129999.9952, "MDV": 0.0}, "recentYear": {"CUB": "2019", "HTI": "2019", "MDV": "2019"}}, "def": "Net bilateral aid flows from DAC donors are the net disbursements of official development assistance (ODA) or official aid from the members of the Development Assistance Committee (DAC). Net disbursements are gross disbursements of grants and loans minus repayments of principal on earlier loans. ODA consists of loans made on concessional terms (with a grant element of at least 25 percent, calculated at a rate of discount of 10 percent) and grants made to promote economic development and welfare in countries and territories in the DAC list of ODA recipients. Official aid refers to aid flows from official donors to countries and territories in part II of the DAC list of recipients: more advanced countries of Central and Eastern Europe, the countries of the former Soviet Union, and certain advanced developing countries and territories. Official aid is provided under terms and conditions similar to those for ODA. Part II of the DAC List was abolished in 2005. The collection of data on official aid and other resource flows to Part II countries ended with 2004 data. DAC members are Australia, Austria, Belgium, Canada, Czech Republic, Denmark, Finland, France, Germany, Greece, Hungary, Iceland, Ireland, Italy, Japan, Korea, Luxembourg, The Netherlands, New Zealand, Norway, Poland, Portugal, Slovak Republic, Slovienia, Spain, Sweden, Switzerland, United Kingdom, United States, and European Union Institutions. Regional aggregates include data for economies not specified elsewhere. World and income group totals include aid not allocated by country or region. Data are in current U.S. dollars.", "name": "Net bilateral aid flows from DAC donors", "source": "Development Assistance Committee of the Organisation for Economic Co-operation and Development, Geographical Distribution of Financial Flows to Developing Countries, Development Co-operation Report, and International Development Statistics database. Data are available online at: https://stats.oecd.org/.", "dataset": "Development Assistance Committee of the Organisation for Economic Co-operation and Development, Geographical Distribution of Financial Flows to Developing Countries, Development Co-operation Report, and International Development Statistics database. Data are available online at: https://stats.oecd.org/.", "category": "Economic Policy & Debt", "subcategory": "Official development assistance", "link": "https://data.worldbank.org/indicator/wdi-DC.DAC.SVKL.CD", "dim": "Slovak Republic", "priority": "1.0", "units": "current US$"}, "confidenceIntervals": {"2008": {}, "2012": {"HTI": 4999.9998875}, "2015": {}, "2016": {"CUB": 5999.999866}, "2017": {}, "2018": {"CUB": 2857.142792857143}, "2019": {"CUB": 1428.5713965714287}, "recentValue": {}}, "featureImportances": {"indicators": {"wdi-IC.FRM.CORR.ZS": 0.905, "unicef-ch6": 0.588, "unicef-spe4": 0.952, "wdi2-NY.GDP.TOTL.RT.ZS": 0.97, "wdi-EG.ELC.NGAS.ZS": 0.619, "wdi2-SP.DYN.IMRT.MA.IN": 0.504, "ndgain-id_infr_06-score": 0.996, "igrac-twap_sids_socioeconomic_totgwabstraction": 0.659, "irena-rh-gen-on": 0.897, "irena-lb-cap-off": 0.197}, "categories": {"Substance use disorders": 0.101, "Characteristic": 0.237, "Non-rheumatic valvular heart disease": 0.204, "Indices": 0.89}}}